Marco-42/RedPill-T/Satellite/esp32/esp32_fun.cpp
// Functions and libraries
#include "esp32_fun.h"


// ---------------------------------
// PRINT FUNCTIONS
// ---------------------------------


// Print boot message on serial
void printStartupMessage(const char* device)
{
	vTaskDelay(500);
	Serial.print(device);
	Serial.print(" starting ... ");
	vTaskDelay(100);
	// Serial.println("ok");
	// Serial.println("");
	// vTaskDelay(100);
}

// Print radio status on serial
void printRadioStatus(int8_t state, bool blocking)
{

	// No error reported
	if (state == RADIOLIB_ERR_NONE)
	{
		// Serial.println("ok");
	}
	else
	{
		Serial.println((String) "failed! --> Code: " + state);
		if (blocking)
		{
			Serial.println("Blocking program until user forces restart!");
			while (true)
			{
				delay(10000);
				Serial.println("Program blocked, please restart ...");
			}
		}
	}
}

// Print received data on serial with optional prefix
void printData(const char* prefix, const uint8_t* data, uint8_t length)
{
    if (prefix != nullptr)
    {
        Serial.print(prefix);
    }
	
	for (uint8_t i = 0; i < length; ++i)
	{
		Serial.printf("%02X ", data[i]);
	}
	Serial.println();
}

// Print packet on serial with optional prefix
void printPacket(const char* prefix, const Packet* packet)
{
	if (prefix != nullptr) {
		Serial.print(prefix);
	}
	Serial.printf("%02X ", packet->station);
	Serial.printf("%02X ", packet->ecc ? RS_ON : RS_OFF);
	Serial.printf("%02X ", packet->command);
	Serial.printf("%02X ", packet->payload_length);
	// Print time_unix as 4 bytes, each as two hex digits, space-separated
	for (int i = 0; i < 4; ++i) {
		Serial.printf("%02X ", (packet->time_unix >> (8 * (3 - i))) & 0xFF);
	}
	// Print MAC as 4 bytes, each as two hex digits, space-separated
	for (int i = 0; i < 4; ++i) {
		Serial.printf("%02X ", (packet->MAC >> (8 * (3 - i))) & 0xFF);
	}
	for (uint8_t i = 0; i < packet->payload_length; ++i) {
		Serial.printf("%02X ", packet->payload[i]);
	}
	Serial.println();
}


// ---------------------------------
// HELPER FUNCTIONS
// ---------------------------------

// Initialize system time to a specific UNIX timestamp, or default to Jan 1, 2025 if 0
void setUNIX(uint32_t unixTime)
{
    time_t t;

    if (unixTime == 0)
    {
        // Default to Jan 1, 2025 at 00:00:00
        struct tm tm_time = {};
        tm_time.tm_year = 2025 - 1900;
        tm_time.tm_mon = 0;
        tm_time.tm_mday = 1;
        tm_time.tm_hour = 0;
        tm_time.tm_min = 0;
        tm_time.tm_sec = 0;

        t = mktime(&tm_time);
    }
    else
    {
        t = static_cast<time_t>(unixTime);
    }

    struct timeval now = { .tv_sec = t, .tv_usec = 0 };
    settimeofday(&now, nullptr);
}

// Get current UNIX time
uint32_t getUNIX()
{
	time_t now = time(nullptr);
    return static_cast<uint32_t>(now);
}

// MAC function to generate a message authentication code
// uint32_t makeMAC(uint32_t timestamp, uint32_t secret_key)
// {
//     uint32_t x = timestamp ^ secret_key;
//     x = ((x >> 16) ^ x) * 0x45d9f3b;
//     x = ((x >> 16) ^ x) * 0x45d9f3b;
//     x = (x >> 16) ^ x;
//     return x;
// }
int8_t makeMAC(const Packet* packet, uint32_t* out_mac)
{
    uint8_t buffer[PACKET_HEADER_LENGTH + PACKET_PAYLOAD_MAX]; // header + max payload
    uint8_t full_output[32]; // full HMAC-SHA256 output
    int ret = 0;

    const mbedtls_md_info_t* md_info;
    mbedtls_md_context_t ctx;
    mbedtls_md_init(&ctx);

    // === Construct header ===
    buffer[0] = packet->station;
    buffer[1] = packet->ecc ? RS_ON : RS_OFF;
    buffer[2] = packet->command;
    buffer[3] = packet->payload_length;

    // === Timestamp: bytes 4–7 ===
    buffer[4] = (packet->time_unix >> 24) & 0xFF;
    buffer[5] = (packet->time_unix >> 16) & 0xFF;
    buffer[6] = (packet->time_unix >> 8)  & 0xFF;
    buffer[7] = (packet->time_unix)       & 0xFF;

    // === MAC placeholder: bytes 8–11 ===
    buffer[8]  = 0;
    buffer[9]  = 0;
    buffer[10] = 0;
    buffer[11] = 0;

    // === Copy payload ===
    memcpy(buffer + PACKET_HEADER_LENGTH, packet->payload, packet->payload_length);

    // === Compute HMAC-SHA256 ===
    md_info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
    if (!md_info) goto fail;

    ret = mbedtls_md_setup(&ctx, md_info, 1); // HMAC enabled
    if (ret != 0) goto fail;

    ret = mbedtls_md_hmac_starts(&ctx, SECRET_KEY, sizeof(SECRET_KEY));
    if (ret != 0) goto fail;

    ret = mbedtls_md_hmac_update(&ctx, buffer, PACKET_HEADER_LENGTH + packet->payload_length);
    if (ret != 0) goto fail;

    ret = mbedtls_md_hmac_finish(&ctx, full_output);
    if (ret != 0) goto fail;

    *out_mac = ((uint32_t)full_output[0] << 24) |
               ((uint32_t)full_output[1] << 16) |
               ((uint32_t)full_output[2] << 8)  |
               ((uint32_t)full_output[3]);

    mbedtls_md_free(&ctx);
    return PACKET_ERR_NONE;

fail:
    mbedtls_md_free(&ctx);
    return PACKET_ERR_MAC;
}

// Write float as 4 byte big endian
void writeFloatToBytes(float value, uint8_t* buffer)
{
	uint32_t value_int;
	memcpy(&value_int, &value, sizeof(float));  // interpret float bits as uint32_t

	buffer[0] = (value_int >> 24) & 0xFF;
	buffer[1] = (value_int >> 16) & 0xFF;
	buffer[2] = (value_int >> 8) & 0xFF;
	buffer[3] = value_int & 0xFF;
}


// ---------------------------------
// RADIO FUNCTIONS
// ---------------------------------

// Notify COMMS task of a radio event (called when packet sent or received)
ICACHE_RAM_ATTR void packetEvent(void)
{
	// Define task to be notified
	BaseType_t higher_priority_task_woken = pdFALSE;
	TaskHandle_t task_to_notify = RTOS_handle_COMMS_StateMachine; // always notify COMMS task

	// Notify task
	vTaskNotifyGiveFromISR(task_to_notify, &higher_priority_task_woken); // notify task
	portYIELD_FROM_ISR(higher_priority_task_woken);
}

// Start LoRa reception
void startReception(void)
{
	// Start listening
	// Serial.print("Listening ... ");
	int8_t rx_state = radio.startReceive();

	// Report listening status
	printRadioStatus(rx_state);
}

// Start LoRa transmission
void startTransmission(uint8_t* tx_packet, uint8_t packet_size)
{
	// Start transmission
	printData("Transmitting: ", tx_packet, packet_size);
	int8_t tx_state = radio.startTransmit(tx_packet, packet_size);
	
	// Report transmission status
	printRadioStatus(tx_state);
}


// ---------------------------------
// PACKET FUNCTIONS
// ---------------------------------

