Marco-42/RedPill-T/Satellite/esp32/esp32_fun.cpp
			uint8_t glass = (glass_bits >> 3) & 0b111;
			uint8_t val0 = glass_bits & 0b111;

			// Validate repeated glass value
			if (glass != val0)
			{
				Serial.println("Glass value mismatch!");
				return PACKET_ERR_CMD_PAYLOAD;
			}

			Serial.printf("Glass state: %d (activation in %d s)\n", glass, activation_delay);
			
			// Cancel previous timer if still active
			if (RTOS_timer_cry_state != NULL)
			{
				xTimerStop(RTOS_timer_cry_state, 0);
				Packet* old_cmd = (Packet*)pvTimerGetTimerID(RTOS_timer_cry_state);
				xTimerDelete(RTOS_timer_cry_state, 0);
				vPortFree(old_cmd); // free memory of old command
				RTOS_timer_cry_state = NULL;
				Serial.println("Cancelled previous Crystals state timer");
			}
			
			// Delayed activation
			if (activation_delay > 0)
			{
				// Create packet with no delay and no pictures to trigger the state change when timer expires
				Packet* delayed_cmd = (Packet*)pvPortMalloc(sizeof(Packet));
				if (delayed_cmd == nullptr)
				{
					Serial.println("Failed to allocate memory for delayed packet");
					return PACKET_ERR_CMD_MEMORY;
				}
				memcpy(delayed_cmd, cmd, sizeof(Packet));

				// Set wanted state and delay to 0 in payload
				printPacket("Packet before editing: ", delayed_cmd);
				memset(delayed_cmd->payload, 0, delayed_cmd->payload_length); // clear payload
				delayed_cmd->payload[0] = glass_bits << 2;
				delayed_cmd->seal(); // seal the packet
				printPacket("Packet after editing: ", delayed_cmd);

				// Duration is in seconds, convert to ticks
				TickType_t ticks = pdMS_TO_TICKS(activation_delay * 1000UL);

				// Create one-shot timer, no need to track globally
				RTOS_timer_cry_state = xTimerCreate("Crystals State Timer",
													ticks,
													pdFALSE,
													(void*)delayed_cmd,
													queueDelayedPacket);
				if (RTOS_timer_cry_state != NULL)
				{
					xTimerStart(RTOS_timer_cry_state, 0);
				}
				else
				{
					vPortFree(delayed_cmd);
				}
			}
			else
			{
				// TODO: set crystals state
			}

			// Next 3 bytes: diode (3 bits), picture (3 bits) + acquisition delay (18 bits)
			uint32_t diode_and_delay =
				((uint32_t)cmd->payload[3] << 16) |
				((uint32_t)cmd->payload[4] << 8) |
				((uint32_t)cmd->payload[5]);

			uint8_t state_bits = (diode_and_delay >> 18) & 0b111111;
			uint32_t acquisition_delay = diode_and_delay & 0x3FFFF;
			uint32_t acquisition_delay_total = activation_delay + acquisition_delay;

			uint8_t diode = (state_bits >> 3) & 0b111;
			uint8_t picture = state_bits & 0b111;

			Serial.printf("Photodiode: %d, Picture: %d (acquisition in %d s after activation)\n", diode, picture, acquisition_delay_total);

			// TODO: always create photodiode acquisition packet and picture acquisition packet, with delay

			break;
		}

		// TODO: deprecate these commands when splitting code for PQ/GS
		case TER_ACK:
			Serial.println("TER: ACK");
			break;

		case TER_NACK:
			Serial.println("TER: NACK");
			break;

		default:
			Serial.println("Unknown TEC!");
			return PACKET_ERR_CMD_UNKNOWN;
	}

	return PACKET_ERR_NONE; // return no error
}

// Check if packet is a TEC to be executed
bool isTEC(uint8_t command)
{
	switch (command)
	{
		case TEC_OBC_REBOOT:
		case TEC_EXIT_STATE:
		case TEC_VAR_CHANGE:
		case TEC_SET_TIME:
		case TEC_EPS_REBOOT:
		case TEC_ADCS_REBOOT:
		case TEC_ADCS_TLE:
		case TEC_LORA_STATE:
		case TEC_LORA_CONFIG:
		case TEC_LORA_PING:
		case TEC_CRY_EXP:
			return true;
	
		default:
			return false; // not a TEC
	}
}

// Check if ACK is needed for the command
bool isACKNeeded(const Packet* packet)
{
	switch (packet->command)
	{
		case TEC_LORA_PING:
			return false; // ACK not needed for these commands
		
		default:
			return true; // ACK needed
	}
}

// // Check if ACK is needed for the command before execution
// bool isACKNeededBefore(const Packet* packet)
// {
// 	switch (packet->command)
// 	{
// 		case TEC_OBC_REBOOT: // before rebooting OBC
// 		case TEC_LORA_CONFIG: // before changing LoRa config
// 			return true;
// 		default:
// 			return false; // ACK not needed early
// 	}
// }

// Send ACK packet to report valid command received
void sendACK(bool ecc, uint8_t TEC)
{
	// Create ACK packet
	Packet ack_packet;
	ack_packet.init(ecc, TER_ACK); // initialize packet

	ack_packet.setPayload(&TEC, 1); // set payload to executed TEC
	ack_packet.seal(); // seal packet with current time and MAC

	// Send ACK packet to queue
	xQueueSend(RTOS_queue_TX, &ack_packet, 0);
}

// Send NACK packet to report invalid command received
void sendNACK(bool ecc, uint8_t TEC, int8_t error)
{
	// Create NACK packet
	Packet nack_packet;
	nack_packet.init(ecc, TER_NACK); // initialize packet

	uint8_t payload[2] = {TEC, static_cast<uint8_t>(error)}; // payload contains TEC and error state
	nack_packet.setPayload(payload, sizeof(payload)); // set payload to executed TEC
	nack_packet.seal(); // seal packet with current time and MAC

	// Send NACK packet to queue
	xQueueSend(RTOS_queue_TX, &nack_packet, 0);
}


// ---------------------------------
// TIMER FUNCTIONS
// ---------------------------------

// Timer callback to queue delayed command packet
void queueDelayedPacket(TimerHandle_t xTimer)
{
	// uint8_t state = PACKET_ERR_NONE;

	TimerPayload* payload = (TimerPayload*)pvTimerGetTimerID(xTimer);
	if (payload != nullptr)
	{
		Packet* delayed_cmd = payload->packet;
		if (xQueueSend(RTOS_queue_cmd, delayed_cmd, 0) != pdPASS)
		{
			// state = PACKET_ERR_CMD_FULL;
			Serial.println("Error: RTOS_queue_cmd is full, delayed command not queued");
		}
		else
		{
			Serial.println("Delayed command queued successfully");
		}

		printPacket("Delayed packet: ", delayed_cmd);

		vPortFree(delayed_cmd);

		// Clear the timer handle
		if (payload->global_handle != nullptr)
		{
			*(payload->global_handle) = NULL;
		}

		vPortFree(payload);
	}

	xTimerDelete(xTimer, 0);

	// return state;
}

// Create a one-shot timer to execute a command after a delay, with optional packet editing
void createDelayedCommand(const Packet* cmd,
									void (*callback)(TimerHandle_t),
									uint32_t delay_seconds,
									void (*editDelayedCommand)(Packet*),
									TimerHandle_t* global_timer_handle,
									const char* timer_name)
{
	// Allocate a copy of the packet
    Packet* delayed_cmd = (Packet*)pvPortMalloc(sizeof(Packet));
    if (delayed_cmd == nullptr)
    {
        Serial.println("Failed to allocate memory for delayed packet");
        // return NULL;
    }

